{
    "alt-version(s)": [
        "Partner Pikachu"
    ],
    "name": "Pikachu",
    "Pikachu": {
        "pokedex_data": {
            "National No.": "0025",
            "Type": [
                "Electric"
            ],
            "Species": "Mouse Pokémon",
            "Height": "0.4 m (1′04′′)",
            "Weight": "6.0 kg (13.2 lbs)",
            "Abilities": {
                "Static": {
                    "href": "/ability/static",
                    "effect": "Contact with the Pokémon may cause paralysis.",
                    "hidden": false
                },
                "Lightning Rod": {
                    "href": "/ability/lightning-rod",
                    "effect": "Draws in all Electric-type moves to up Sp. Attack.",
                    "hidden": true
                }
            }
        },
        "training_data": {
            "EV yield": "2 Speed",
            "Catch rate": "190",
            "BaseFriendship": "50",
            "Base Exp.": "112",
            "Growth Rate": "Medium Fast"
        },
        "breeding_data": {
            "Gender": "50% male,50% female"
        },
        "base_stats": {
            "HP": {
                "Base": "35",
                "Min": "180",
                "Max": "274"
            },
            "Attack": {
                "Base": "55",
                "Min": "103",
                "Max": "229"
            },
            "Defense": {
                "Base": "40",
                "Min": "76",
                "Max": "196"
            },
            "Sp. Atk": {
                "Base": "50",
                "Min": "94",
                "Max": "218"
            },
            "Sp. Def": {
                "Base": "50",
                "Min": "94",
                "Max": "218"
            },
            "Speed": {
                "Base": "90",
                "Min": "166",
                "Max": "306"
            },
            "Total": "320"
        },
        "defense_stats": {
            "Static ability": {
                "Electric": "not very effective",
                "Ground": "super-effective",
                "Flying": "not very effective",
                "Steel": "not very effective"
            },
            "Lightning Rod ability": {
                "Electric": "no effect",
                "Ground": "super-effective",
                "Flying": "not very effective",
                "Steel": "not very effective"
            }
        }
    },
    "Partner Pikachu": {
        "pokedex_data": {
            "National No.": "0025",
            "Type": [
                "Electric"
            ],
            "Species": "Mouse Pokémon",
            "Height": "0.4 m (1′04′′)",
            "Weight": "6.0 kg (13.2 lbs)",
            "Abilities": {}
        },
        "training_data": {
            "EV yield": "2 Speed",
            "Catch rate": "190",
            "BaseFriendship": "50",
            "Base Exp.": "112",
            "Growth Rate": "Medium Fast"
        },
        "breeding_data": {
            "Gender": "50% male,50% female"
        },
        "base_stats": {
            "HP": {
                "Base": "45",
                "Min": "200",
                "Max": "294"
            },
            "Attack": {
                "Base": "80",
                "Min": "148",
                "Max": "284"
            },
            "Defense": {
                "Base": "50",
                "Min": "94",
                "Max": "218"
            },
            "Sp. Atk": {
                "Base": "75",
                "Min": "139",
                "Max": "273"
            },
            "Sp. Def": {
                "Base": "60",
                "Min": "112",
                "Max": "240"
            },
            "Speed": {
                "Base": "120",
                "Min": "220",
                "Max": "372"
            },
            "Total": "430"
        },
        "defense_stats": {
            "default": {
                "Electric": "not very effective",
                "Ground": "super-effective",
                "Flying": "not very effective",
                "Steel": "not very effective"
            }
        }
    },
    "evo_stats": [
        [
            {
                "from": {
                    "name": "Pichu",
                    "nationalNo": "#0172",
                    "type": [
                        "Electric"
                    ],
                    "nickname": null
                },
                "to": {
                    "name": "Pikachu",
                    "nationalNo": "#0025",
                    "type": [
                        "Electric"
                    ],
                    "nickname": null
                },
                "requirement": "(high Friendship)",
                "shed": null
            },
            {
                "from": {
                    "name": "Pikachu",
                    "nationalNo": "#0025",
                    "type": [
                        "Electric"
                    ],
                    "nickname": null
                },
                "to": {
                    "name": "Raichu",
                    "nationalNo": "#0026",
                    "type": [
                        "Electric"
                    ],
                    "nickname": null
                },
                "requirement": "(use Thunder Stone, outside Alola)",
                "shed": null
            },
            {
                "from": {
                    "name": "Pikachu",
                    "nationalNo": "#0025",
                    "type": [
                        "Electric"
                    ],
                    "nickname": null
                },
                "to": {
                    "name": "Raichu",
                    "nationalNo": "#0026",
                    "type": [
                        "Electric",
                        "Psychic"
                    ],
                    "nickname": "Alolan Raichu"
                },
                "requirement": "(use Thunder Stone, in Alola)",
                "shed": null
            }
        ]
    ],
    "attacks_data": {
        "moves": {
            "Charm": "1",
            "Growl": "1",
            "Nasty Plot": "1",
            "Nuzzle": "1",
            "Play Nice": "1",
            "Quick Attack": "1",
            "Sweet Kiss": "1",
            "Tail Whip": "1",
            "Thunder Shock": "1",
            "Thunder Wave": "4",
            "Double Team": "8",
            "Electro Ball": "12",
            "Feint": "16",
            "Spark": "20",
            "Agility": "24",
            "Iron Tail": "28",
            "Discharge": "32",
            "Thunderbolt": "36",
            "Light Screen": "40",
            "Thunder": "44"
        },
        "egg": {
            "Charge": null,
            "Disarming Voice": null,
            "Fake Out": null,
            "Flail": null,
            "Present": null,
            "Tickle": null,
            "Wish": null
        },
        "tm": {
            "Take Down": "01",
            "Charm": "02",
            "Fake Tears": "03",
            "Agility": "04",
            "Protect": "07",
            "Thief": "18",
            "Disarming Voice": "19",
            "Trailblaze": "20",
            "Charge Beam": "23",
            "Facade": "25",
            "Swift": "32",
            "Draining Kiss": "37",
            "Fling": "43",
            "Endure": "47",
            "Volt Switch": "48",
            "Rain Dance": "50",
            "Dig": "55",
            "Brick Break": "58",
            "Body Slam": "66",
            "Thunder Punch": "68",
            "Sleep Talk": "70",
            "Electro Ball": "72",
            "Reflect": "74",
            "Light Screen": "75",
            "Grass Knot": "81",
            "Thunder Wave": "82",
            "Rest": "85",
            "Eerie Impulse": "96",
            "Substitute": "103",
            "Encore": "122",
            "Surf": "123",
            "Thunderbolt": "126",
            "Play Rough": "127",
            "Helping Hand": "130",
            "Reversal": "134",
            "Electric Terrain": "136",
            "Nasty Plot": "140",
            "Wild Charge": "147",
            "Thunder": "166",
            "Tera Blast": "171"
        }
    },
    "entries": {
        "Pikachu": [
            "When several of these pokémon gather, their electricity could build and cause lightning storms.",
            "It keeps its tail raised to monitor its surroundings. If you yank its tail, it will try to bite you.",
            "This intelligent pokémon roasts hard BERRIES with electricity to make them tender enough to eat.",
            "It raises its tail to check its surroundings. The tail is sometimes struck by lightning in this pose.",
            "When it is angered, it immediately discharges the energy stored in the pouches in its cheeks.",
            "Whenever PIKACHU comes across something new, it blasts it with a jolt of electricity. If you come across a blackened berry, it’s evidence that this pokémon mistook the intensity of its charge.",
            "This pokémon has electricity-storing pouches on its cheeks. These appear to become electrically charged during the night while PIKACHU sleeps. It occasionally discharges electricity when it is dozy after waking up.",
            "It has small electric sacs on both its cheeks. If threatened, it looses electric charges from the sacs.",
            "When several of these pokémon gather, their electricity can build and cause lightning storms.",
            "It stores electricity in the electric sacs on its cheeks. When it releases pent-up energy in a burst, the electric power is equal to a lightning bolt.",
            "It lives in forests with others. It stores electricity in the pouches on its cheeks.",
            "If it looses crackling power from the electric pouches on its cheeks, it is being wary.",
            "It occasionally uses an electric shock to recharge a fellow PIKACHU that is in a weakened state.",
            "This intelligent Pokémon roasts hard berries with electricity to make them tender enough to eat.",
            "It raises its tail to check its surroundings. The tail is sometimes struck by lightning in this pose.",
            "It occasionally uses an electric shock to recharge a fellow Pikachu that is in a weakened state.",
            "It raises its tail to check its surroundings. The tail is sometimes struck by lightning in this pose.",
            "It has small electric sacs on both its cheeks. If threatened, it looses electric charges from the sacs.",
            "Whenever Pikachu comes across something new, it blasts it with a jolt of electricity. If you come across a blackened berry, it’s evidence that this Pokémon mistook the intensity of its charge.",
            "This Pokémon has electricity-storing pouches on its cheeks. These appear to become electrically charged during the night while Pikachu sleeps. It occasionally discharges electricity when it is dozy after waking up.",
            "A plan was recently announced to gather many Pikachu and make an electric power plant.",
            "It’s in its nature to store electricity. It feels stressed now and then if it’s unable to fully discharge the electricity.",
            "Its nature is to store up electricity. Forests where nests of Pikachu live are dangerous, since the trees are so often struck by lightning.",
            "While sleeping, it generates electricity in the sacs in its cheeks. If it’s not getting enough sleep, it will be able to use only weak electricity.",
            "This forest-dwelling Pokémon stores electricity in its cheeks, so you’ll feel a tingly shock if you touch it.",
            "Pikachu that can generate powerful electricity have cheek sacs that are extra soft and super stretchy.",
            "When Pikachu meet, they’ll touch their tails together and exchange electricity through them as a form of greeting.",
            "It lives in forests with others. It stores electricity in the electric sacs on its cheeks.",
            "If it looses crackling power from the electric sacs on its cheeks, it is being wary.",
            "Possesses cheek sacs in which it stores electricity. This clever forest-dweller roasts tough berries with an electric shock before consuming them.",
            "When it is angered, it immediately discharges the energy stored in the pouches in its cheeks.",
            "When several of these Pokémon gather, their electricity can build and cause lightning storms."
        ],
        "Cap Pikachu": [
            "This form of Pikachu is somewhat rare. It wears the hat of its Trainer, who is also its partner.",
            "This Pikachu is wearing its Trainer’s cap. Since the cap’s not the right size, the fit is a bit loose."
        ],
        "World Cap": [
            "This Pikachu wears its partner’s cap, which is brimming with memories of traveling through different regions.",
            "This Pikachu is wearing its Trainer’s cap. The cap is a precious symbol that travels across different regions with Pikachu.",
            "The cap this Pikachu wears is filled with memories of this Pokémon and its partner traveling across the world together.",
            "This Pikachu wears its partner’s cap—proof of the strong bond Pikachu and its partner formed during adventures across the world."
        ],
        "Unova Cap": [
            "This Pikachu wears its partner’s cap, which is brimming with memories of traveling through the Unova region.",
            "This Pikachu is wearing its Trainer’s cap. The cap is proof that the two traveled throughout the Unova region together.",
            "The cap this Pikachu wears is filled with memories of this Pokémon and its partner traveling across the Unova region together.",
            "This Pikachu wears its partner’s cap—proof of the strong bond Pikachu and its partner formed during adventures across the Unova region."
        ],
        "Sinnoh Cap": [
            "This Pikachu wears its partner’s cap, which is brimming with memories of traveling through the Sinnoh region.",
            "This Pikachu is wearing its Trainer’s cap. The cap is proof that the two traveled throughout the Sinnoh region together.",
            "The cap this Pikachu wears is filled with memories of this Pokémon and its partner traveling across the Sinnoh region together.",
            "This Pikachu wears its partner’s cap—proof of the strong bond Pikachu and its partner formed during adventures across the Sinnoh region."
        ],
        "Partner Cap": [
            "This Pikachu wears its partner’s cap, which is brimming with memories of when they first met.",
            "This Pikachu is wearing its Trainer’s cap. The cap is a precious symbol of a fateful encounter.",
            "The cap this Pikachu wears is filled with memories of this Pokémon traveling together with its partner, whom it met in a fateful encounter.",
            "This Pikachu wears its partner’s cap—proof of the strong bond Pikachu and its partner formed as the two overcame many hardships together."
        ],
        "Original Cap": [
            "This Pikachu wears its partner’s cap, which is brimming with memories of traveling through many different regions.",
            "This Pikachu is wearing its Trainer’s cap. The cap is proof that the two traveled across many regions together.",
            "The cap this Pikachu wears is filled with memories of this Pokémon and its partner traveling across lots of different regions together.",
            "This Pikachu wears its partner’s cap—proof of the strong bond Pikachu and its partner formed during adventures across many different regions."
        ],
        "Kalos Cap": [
            "This Pikachu wears its partner’s cap, which is brimming with memories of traveling through the Kalos region.",
            "This Pikachu is wearing its Trainer’s cap. The cap is proof that the two traveled throughout the Kalos region together.",
            "The cap this Pikachu wears is filled with memories of this Pokémon and its partner traveling across the Kalos region together.",
            "This Pikachu wears its partner’s cap—proof of the strong bond Pikachu and its partner formed during adventures across the Kalos region."
        ],
        "Hoenn Cap": [
            "This Pikachu wears its partner’s cap, which is brimming with memories of traveling through the Hoenn region.",
            "This Pikachu is wearing its Trainer’s cap. The cap is proof that the two traveled throughout the Hoenn region together.",
            "The cap this Pikachu wears is filled with memories of this Pokémon and its partner traveling across the Hoenn region together.",
            "This Pikachu wears its partner’s cap—proof of the strong bond Pikachu and its partner formed during adventures across the Hoenn region."
        ],
        "Alola Cap": [
            "This Pikachu wears its partner’s cap, which is brimming with memories of traveling through the Alola region.",
            "This Pikachu is wearing its Trainer’s cap. The cap is proof that the two traveled throughout the Alola region together.",
            "The cap this Pikachu wears is filled with memories of this Pokémon and its partner traveling across the Alola region together.",
            "This Pikachu wears its partner’s cap—proof of the strong bond Pikachu and its partner formed during adventures across the Alola region."
        ],
        "Gigantamax": [
            "Its Gigantamax power expanded, forming its supersized body and towering tail.",
            "When it smashes its opponents with its bolt- shaped tail, it delivers a surge of electricity equivalent to a lightning strike."
        ]
    }
}